app/Views/admin/dashboard.php

SELECT *
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 5
---
                        <?php
                        // Get all users
                        $userModel = new \App\Models\UserModel();
                        $users = $userModel->orderBy('created_at', 'DESC')->findAll(5); // Show latest 5 users