app/Controllers/Admin.php

    public function dashboard()
{
    $db = \Config\Database::connect();

    $data = [
        'title' => 'Admin Dashboard',
        'totalUsers' => $db->table('users')->countAllResults(),
        'totalTeachers' => $db->table('users')->where('role', 'Teacher')->countAllResults(),
        'totalStudents' => $db->table('users')->where('role', 'Student')->countAllResults(),
        'totalCourses' => $db->table('courses')->countAllResults(),
        'recentCourses' => $db->table('courses')
            ->select('courses.*, users.name as instructor_name')
            ->join('users', 'users.id = courses.course_instructor')
            ->orderBy('courses.created_at', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray()
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'Teacher'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'Student'
SELECT COUNT(*) AS `numrows`
FROM `courses`
SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`course_instructor`
ORDER BY `courses`.`created_at` DESC
 LIMIT 5

    public function users()
    {
    $db = \Config\Database::connect();
    $users = $db->table('users')
               ->orderBy('created_at', 'DESC')
               ->get()
               ->getResultArray();
---
SELECT *
FROM `users`
ORDER BY `created_at` DESC

public function courses()
{
    $db = \Config\Database::connect();

    $courses = $db->table('courses')
        ->select('courses.*, users.name as instructor_name')
        ->join('users', 'users.id = courses.course_instructor')
        ->orderBy('courses.created_at', 'DESC')
        ->get()
        ->getResultArray();
---
SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`course_instructor`
ORDER BY `courses`.`created_at` DESC

public function viewCourse($courseId = null)
{
    if (!$courseId) {
        return redirect()->to('/admin/courses')->with('error', 'Invalid course ID');
    }

    $db = \Config\Database::connect();

    // Get course details
    $course = $db->table('courses')
    ->select('courses.*, users.name as instructor_name, users.email as instructor_email')
    ->join('users', 'users.id = courses.course_instructor')
    ->where('courses.course_id', $courseId)
    ->get()
    ->getRowArray();

    if (!$course) {
        return redirect()->to('/admin/courses')->with('error', 'Course not found');
    }

    // Get enrolled students
    // In viewCourse method, update the enrolledStudents query
    $enrolledStudents = $db->table('enrollments')
    ->select('enrollments.*, users.name as student_name, users.email as student_email, users.id as user_id')
    ->join('users', 'users.id = enrollments.user_id')
    ->where('enrollments.course_id', $courseId)
    ->get()
    ->getResultArray();
---
SELECT `courses`.*, `users`.`name` as `instructor_name`, `users`.`email` as `instructor_email`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`course_instructor`
WHERE `courses`.`course_id` = '5'
SELECT `enrollments`.*, `users`.`name` as `student_name`, `users`.`email` as `student_email`, `users`.`id` as `user_id`
FROM `enrollments`
JOIN `users` ON `users`.`id` = `enrollments`.`user_id`
WHERE `enrollments`.`course_id` = '5'

    // If no students are enrolled, we need to handle that case
    $availableStudents = [];
    if (!empty($enrolledStudentIds)) {
        $availableStudents = $db->table('users')
            ->where('role', 'Student')
            ->whereNotIn('id', $enrolledStudentIds)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `users`
WHERE `role` = 'Student'

public function editCourse($courseId)
{
    $db = \Config\Database::connect();

    $course = $db->table('courses')
        ->select('courses.*, users.name as instructor_name')
        ->join('users', 'users.id = courses.course_instructor')
        ->where('courses.course_id', $courseId)
        ->get()
        ->getRowArray();

    if (!$course) {
        return redirect()->to('/admin/courses')->with('error', 'Course not found');
    }

    // Get all teachers for the dropdown
    $teachers = $db->table('users')
        ->where('role', 'Teacher')
        ->get()
        ->getResultArray();
---
SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`course_instructor`
WHERE `courses`.`course_id` = '5'
SELECT *
FROM `users`
WHERE `role` = 'Teacher'

public function removeStudent($courseId, $studentId)
{
    $db = \Config\Database::connect();

    // Remove enrollment
    $db->table('enrollments')
        ->where('course_id', $courseId)
        ->where('user_id', $studentId)  // Changed from user_id to student_id
        ->delete();
---
DELETE FROM `enrollments`
WHERE `course_id` = '5'
AND `user_id` = '6'

public function deleteCourse($courseId = null)
{
    $db = \Config\Database::connect();

    // Verify course exists
    $course = $db->table('courses')
        ->where('course_id', $courseId)
        ->get()
        ->getRowArray();

    if (!$course) {
        log_message('error', "Attempted to delete non-existent course: $courseId");
        return redirect()->back()->with('error', 'Course not found');
    }

    try {
        // Start transaction
        $db->transStart();

        // First delete all enrollments for this course
        $db->table('enrollments')
            ->where('course_id', $courseId)
            ->delete();

        // Then delete the course
        $db->table('courses')
            ->where('course_id', $courseId)
            ->delete();
---
SELECT *
FROM `courses`
WHERE `course_id` = '5'
DELETE FROM `enrollments`
WHERE `course_id` = '5'
DELETE FROM `courses`
WHERE `course_id` = '5'