app/Controllers/Auth.php

    public function login()
    {
        // If this is a POST request, process the login
        if ($this->request->getMethod() === 'POST') {
            $login = $this->request->getPost('login');
            $password = $this->request->getPost('password');

            // Basic validation
            if (empty($login) || empty($password)) {
                $this->session->setFlashdata('error', 'Please enter both login and password.');
                return redirect()->to(base_url('login'))->withInput();
            }

            // Hardcoded admin login (for testing only - remove in production)
            if ($login === 'admin' && $password === 'admin123') {
                $this->session->set([
                    'userID'     => 1,
                    'name'       => 'Admin',
                    'email'      => 'admin@rmmc.com',
                    'role'       => 'admin',
                    'isLoggedIn' => true
                ]);
                $this->session->setFlashdata('success', 'Welcome back, Administrator!');
                return redirect()->to(base_url('admin/dashboard'));
            }

            // Check DB for user
            $builder = $this->db->table('users');
            $user = $builder->where('email', $login)
                          ->orWhere('name', $login)
                          ->get()
                          ->getRowArray();
---
SELECT *
FROM `users`
WHERE `email` = 'lorenzo@gmail.com'
OR `name` = 'lorenzo@gmail.com'