app/Controllers/Materials.php

INSERT INTO `materials` (`course_id`, `file_name`, `file_path`, `created_at`) VALUES ('2', 'Resume(Final).pdf', 'uploads/materials/2025/12/12/1765511915_a3ed8df6d27342e61607.pdf', '2025-12-12 03:58:35')
---
    public function upload($courseId = null)
{
    try {
        $file = $this->request->getFile('material');

        if ($file->isValid() && !$file->hasMoved()) {
            $newName = $file->getRandomName();
            $uploadPath = 'uploads/materials/' . date('Y/m/d');

            // Create directory if it doesn't exist
            if (!is_dir(WRITEPATH . $uploadPath)) {
                mkdir(WRITEPATH . $uploadPath, 0777, true);
            }

            $file->move(WRITEPATH . $uploadPath, $newName);
            $filePath = $uploadPath . '/' . $newName;

            // Save to database
            $data = [
                'course_id' => $courseId,
                'file_name' => $file->getClientName(),
                'file_path' => $filePath,
                'created_at' => date('Y-m-d H:i:s')
            ];

            if ($this->materialModel->insert($data)) {