app/Controllers/Student.php

    public function dashboard()
    {
        $userId = session()->get('userID');
        $searchTerm = $this->request->getGet('search_term');

        // Get all available courses with instructor names
        $db = \Config\Database::connect();
        $query = $db->table('courses')
            ->select('courses.*, users.name as instructor_name')
            ->join('users', 'users.id = courses.course_instructor', 'left');

        // Add search functionality if search term exists
        if (!empty($searchTerm)) {
            $query->groupStart()
                ->like('courses.course_name', $searchTerm)
                ->orLike('courses.course_code', $searchTerm)
                ->orLike('courses.description', $searchTerm)
                ->orLike('users.name', $searchTerm)
                ->groupEnd();
        }

        $availableCourses = $query->get()->getResultArray();
---
SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`course_instructor`
WHERE   (
`courses`.`course_name` LIKE '%Life And Works%' ESCAPE '!'
OR  `courses`.`course_code` LIKE '%Life And Works%' ESCAPE '!'
OR  `courses`.`description` LIKE '%Life And Works%' ESCAPE '!'
OR  `users`.`name` LIKE '%Life And Works%' ESCAPE '!'
 )