app/Controllers/Student.php

SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`course_instructor`
---
    public function dashboard()
    {
        $userId = session()->get('userID');


        // Get all available courses with instructor names
        $db = \Config\Database::connect();
        $availableCourses = $db->table('courses')
            ->select('courses.*, users.name as instructor_name')
            ->join('users', 'users.id = courses.course_instructor', 'left')
            ->get()
            ->getResultArray();

SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
JOIN `users` ON `users`.`id` = `courses`.`course_instructor`
WHERE `courses`.`course_id` = '2'
---
    public function viewCourse($courseId = null)
{
    try {
        $studentId = session()->get('userID');
        log_message('debug', "Viewing course $courseId for student $studentId");

        // Check if user is enrolled in this course
        $enrollment = $this->enrollmentModel->where([
            'student_id' => $studentId,
            'course_id' => $courseId
        ])->first();

        if (!$enrollment) {
            log_message('error', "Student $studentId not enrolled in course $courseId");
            return redirect()->to('/student/dashboard')->with('error', 'You are not enrolled in this course');
        }

        // Get course details
        $course = $this->courseModel->find($courseId);