app/Models/CourseModel.php

SELECT `courses`.*, `users`.`name` as `instructor_name`
FROM `courses`
LEFT JOIN `users` ON `users`.`id` = `courses`.`course_instructor`
WHERE `courses`.`course_id` = '2'
 LIMIT 1
---
   public function getCourseWithInstructor($courseId)
{
    return $this->select('courses.*, users.name as instructor_name')
               ->join('users', 'users.id = courses.course_instructor', 'left')
               ->where('courses.course_id', $courseId)
               ->first();