app/Models/EnrollmentModel.php

    public function getUserEnrollments($user_id)
    {
        return $this->select('enrollments.*, courses.course_name, courses.description,
                         users.name as instructor_name, users.email as instructor_email')
                ->join('courses', 'courses.course_id = enrollments.course_id')
                ->join('users', 'users.id = courses.course_instructor')
                ->where('enrollments.user_id', $user_id)
                ->findAll();
---
SELECT `enrollments`.*, `courses`.`course_name`, `courses`.`description`, `users`.`name` as `instructor_name`, `users`.`email` as `instructor_email`
FROM `enrollments`
JOIN `courses` ON `courses`.`course_id` = `enrollments`.`course_id`
JOIN `users` ON `users`.`id` = `courses`.`course_instructor`
WHERE `enrollments`.`user_id` = '3'

    public function isAlreadyEnrolled($user_id, $course_id)
    {
        return $this->where('user_id', $user_id)
                   ->where('course_id', $course_id)
                   ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `user_id` = '3'
AND `course_id` = '2'

    public function getEnrollment($userId, $courseId)
    {
        return $this->where('user_id', $userId)
                   ->where('course_id', $courseId)
                   ->first();
---
SELECT *
FROM `enrollments`
WHERE `user_id` = '3'
AND `course_id` = '2'
 LIMIT 1